// Задача 7
Console.WriteLine("Введите техзначное чило: ");
int num = int.Parse(Console.ReadLine());
Console.WriteLine(num % 10);
